Revit.Elements.Views.AxonometricView.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,System.String,System.Boolean)
Private constructor

Revit.Elements.Views.AxonometricView.ByEyePointAndTarget(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Object,System.String,System.Boolean)
Create a Revit Axonometric (isometric) View from an Eye position,
a target position, and either an Element or BoundingBox.
eyePoint: A Point representing the eye point in meters.
target: A Point representing the target of view in meters.
element: This argument cannot be null, and it has to be either a
Revit.Elements.Element or  Revit.GeometryObjectsBoundingBox.
name: The name of the view.
isolateElement: If this argument is set to true, the element or
bounding box will be isolated in the current view by creating a minimum size
crop box around it.
Returns: Returns the resulting AxonometricView object.

Revit.Elements.Views.AxonometricView.ByEyePointTargetAndElement(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Revit.Elements.Element,System.String,System.Boolean)
Create a Revit Axonometric (isometric) View from an Eye position and target position and Element
eyePoint: Eye point in meters
target: Target of view in meters
element:
name:
isolateElement:
Returns:

Revit.Elements.Views.AxonometricView.ByEyePointTargetAndBoundingBox(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.BoundingBox,System.String,System.Boolean)
Create a Revit Axonometric (isometric) View from an Eye position and target position and Bounding Box
eyePoint: Eye point in meters
target: Target of view in meters
boundingBox: Bounding box represented in meters
name:
isolateElement:
Returns: